package offer.amzon.oa;

/**
 * ClassName: RouterProblem
 * Description:
 * 1. 路由器服务问题
 * 现在有一排建筑物呈线性排列， 每一个建筑都需要不同数量的路由器信号覆盖。现给出一个数组，数组的内容为每一栋建筑物需要的路由器数量。如｛4,1,2｝为有三栋楼，分别需要4,1,2个路由器信号覆盖。
 * 现给出第二个数组，数组代表每个路由器所在的位置。如｛2,1｝为有2个路由器，分别放置在第二栋楼和第一栋楼。
 * 在给出第三个数组，数组代表每个路由器的信号范围。如｛3,1｝为1号路由器的辐射半径为3，除了覆盖其所在的楼外还能额外覆盖左边两栋和右边两栋。二号路由器辐射半径为1，其只能覆盖其所在楼。
 * 请计算出被完全服务的建筑物的数量。（被完全服务为覆盖该建筑物的路由器数量大于或等于其所需要的数量）
 * date: 28/5/2022 上午9:36
 *
 * @author liyh
 */
public class RouterProblem {
    public static void main(String[] args) {

    }
}
